<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class TripTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $trip = [
            'price' => rand(1, 785),
           
            'name' => 'فندق المهاجر',
            'image' => 'trip/1.png',
            'country' => 'الامارات', 
            
            'review' => rand(0, 5),
            'status' => '1',
            'event_id' => 1,
            'user_id' => 1,
            'created_at' => now(),
            'updated_at' => now(),
        ];

        $trip_id = DB::table('trips')->insertGetId($trip);

        $trip_details = [
            
          
            'bank' => 'نقدي',      
            'description' => 'قد يظن البعض أن الفائدة من السفر والرحلات هو تغيير الجو وتحسين النفسية كما يقولون، ولا يعلم الكثيرين أن للسفر فوائد ومنافع أخرى تنعكس على شخصية الفرد وثقافته وتجعله يحب السفر والترحال كثيراً، وقد نقل التاريخ المعلومات عن الكثير من الشخصيات العظيمة التي اكتسبت مكانتها بسبب سفرها والفوائد التي جنتها من ذلك، وفيما يأتي نذكر فوائد السفر. فوائد السفر والرحلات زيادة الثقافة حيث إن الاهتمام بالجغرافيا وبعادات الشعوب وطريقة حياتهم يجعل الشخص ملمّاً بجغرافية البلاد بشكل كبير ولديه معلومات ثابتة وصحيحة في ذهنه عن تلك البلاد،',
            'working_days' => 'السبت,الاحد,الاثنين,الثلاثاء,الاربعاء,الخميس',
            'price_day' => rand(1, 300),
            'price_hour' => rand(1, 100),
            'start_time' => '2023/3/15',
            'end_time' => '2023/3/25',
            'addrees' => 'دبي مول وبجوار برج خليفة',      
            'season' => 'الربيع',
            'city' => 'الشارقه',
            'longitude' => '55.296249',
            'latitude' => '25.276987',
            'trip_id' => $trip_id,
        ];

        DB::table('trip_detalis')->insert($trip_details);

        

        $trip_facilities = [
            [
                'trip_id' => $trip_id,
                'name' => 'قوارب',

            ],
            [
                'trip_id' => $trip_id,
                'name' => 'تنظيف مجاني',

            ],
            [
                'trip_id' => $trip_id,
                'name' => 'انترنت',

            ],
        ];
        DB::table('features')->insert($trip_facilities);




        //------------------------------------------------------------------------------------- 1



        $trip = [
               'price' => rand(1, 785),
           
            'name' => 'شاليه السحاب.',
            'image' => 'trip/2.png',
            'country' => 'الامارات',
            'review' => rand(0, 5),
            'status' => '1',
            'event_id' => 1,
            'user_id' => 1,
            'created_at' => now(),
            'updated_at' => now(),
        ];

        $trip_id = DB::table('trips')->insertGetId($trip);

        $trip_details = [
            
            
            'bank' => 'رقمي',      
            'description' => 'قد يظن البعض أن الفائدة من السفر والرحلات هو تغيير الجو وتحسين النفسية كما يقولون، ولا يعلم الكثيرين أن للسفر فوائد ومنافع أخرى تنعكس على شخصية الفرد وثقافته وتجعله يحب السفر والترحال كثيراً، وقد نقل التاريخ المعلومات عن الكثير من الشخصيات العظيمة التي اكتسبت مكانتها بسبب سفرها والفوائد التي جنتها من ذلك، وفيما يأتي نذكر فوائد السفر. فوائد السفر والرحلات زيادة الثقافة حيث إن الاهتمام بالجغرافيا وبعادات الشعوب وطريقة حياتهم يجعل الشخص ملمّاً بجغرافية البلاد بشكل كبير ولديه معلومات ثابتة وصحيحة في ذهنه عن تلك البلاد،',
            'working_days' => 'السبت,الاحد,الاثنين,الثلاثاء,الاربعاء,الخميس',
            'price_day' => rand(1, 300),
            'price_hour' => rand(1, 100),
            'start_time' => '2023/3/15',
            'end_time' => '2023/3/25',
            'addrees' => 'دبي مول وبجوار برج خليفة',      
            'season' => 'الخريف',
            'city' => 'دبي',
            'longitude' => '55.296249',
            'latitude' => '25.276987',
            'trip_id' => $trip_id,
        ];

        DB::table('trip_detalis')->insert($trip_details);

        

        $trip_facilities = [
            [
                'trip_id' => $trip_id,
                'name' => 'قوارب',

            ],
            [
                'trip_id' => $trip_id,
                'name' => 'تنظيف مجاني',

            ],
            [
                'trip_id' => $trip_id,
                'name' => 'انترنت',

            ],
        ];
        DB::table('features')->insert($trip_facilities);




        //-------------------------------------------------------------------------------------2

        $trip = [
               'price' => rand(1, 785),
           
            'name' => 'شاليه الشاطيء.',
            'image' => 'trip/3.png',
            'country' => 'الامارات',
            'review' => rand(0, 5),
            'status' => '1',
            'event_id' => 1,
            'user_id' => 1,
            'created_at' => now(),
            'updated_at' => now(),
        ];

        $trip_id = DB::table('trips')->insertGetId($trip);

        $trip_details = [
            
            
            'bank' => 'حساب بنكي',      
            'description' => 'قد يظن البعض أن الفائدة من السفر والرحلات هو تغيير الجو وتحسين النفسية كما يقولون، ولا يعلم الكثيرين أن للسفر فوائد ومنافع أخرى تنعكس على شخصية الفرد وثقافته وتجعله يحب السفر والترحال كثيراً، وقد نقل التاريخ المعلومات عن الكثير من الشخصيات العظيمة التي اكتسبت مكانتها بسبب سفرها والفوائد التي جنتها من ذلك، وفيما يأتي نذكر فوائد السفر. فوائد السفر والرحلات زيادة الثقافة حيث إن الاهتمام بالجغرافيا وبعادات الشعوب وطريقة حياتهم يجعل الشخص ملمّاً بجغرافية البلاد بشكل كبير ولديه معلومات ثابتة وصحيحة في ذهنه عن تلك البلاد،',
            'working_days' => 'السبت,الاحد,الاثنين,الثلاثاء,الاربعاء,الخميس',
            'price_day' => rand(1, 300),
            'price_hour' => rand(1, 100),
            'start_time' => '2023/3/15',
            'end_time' => '2023/3/25',
            'addrees' => 'دبي مول وبجوار برج خليفة',      
            'season' => 'الصيف',
            'city' => 'عجمان',
            'longitude' => '55.296249',
            'latitude' => '25.276987',
            'trip_id' => $trip_id,
        ];

        DB::table('trip_detalis')->insert($trip_details);

        

        $trip_facilities = [
            [
                'trip_id' => $trip_id,
                'name' => 'قوارب',

            ],
            [
                'trip_id' => $trip_id,
                'name' => 'تنظيف مجاني',

            ],
            [
                'trip_id' => $trip_id,
                'name' => 'انترنت',

            ],
        ];
        DB::table('features')->insert($trip_facilities);




        //------------------------------------------------------------------------------------- 3

        $trip = [
               'price' => rand(1, 785),
           
            'name' => 'فندق خمس نجوم.',
            'image' => 'trip/4.png',
            'country' => 'الامارات',
            'review' => rand(0, 5),
            'status' => '1',
            'event_id' => 1,
            'user_id' => 1,
            'created_at' => now(),
            'updated_at' => now(),
        ];

        $trip_id = DB::table('trips')->insertGetId($trip);

        $trip_details = [
            
            
            'bank' => 'نقدي',      
            'description' => 'قد يظن البعض أن الفائدة من السفر والرحلات هو تغيير الجو وتحسين النفسية كما يقولون، ولا يعلم الكثيرين أن للسفر فوائد ومنافع أخرى تنعكس على شخصية الفرد وثقافته وتجعله يحب السفر والترحال كثيراً، وقد نقل التاريخ المعلومات عن الكثير من الشخصيات العظيمة التي اكتسبت مكانتها بسبب سفرها والفوائد التي جنتها من ذلك، وفيما يأتي نذكر فوائد السفر. فوائد السفر والرحلات زيادة الثقافة حيث إن الاهتمام بالجغرافيا وبعادات الشعوب وطريقة حياتهم يجعل الشخص ملمّاً بجغرافية البلاد بشكل كبير ولديه معلومات ثابتة وصحيحة في ذهنه عن تلك البلاد،',
            'working_days' => 'السبت,الاحد,الاثنين,الثلاثاء,الاربعاء,الخميس',
            'price_day' => rand(1, 300),
            'price_hour' => rand(1, 100),
            'start_time' => '2023/3/15',
            'end_time' => '2023/3/25',
            'addrees' => 'دبي مول وبجوار برج خليفة',      
            'season' => 'الصيف',
            'city' => 'ابوظبي',
            'longitude' => '55.296249',
            'latitude' => '25.276987',
            'trip_id' => $trip_id,
        ];

        DB::table('trip_detalis')->insert($trip_details);

        

        $trip_facilities = [
            [
                'trip_id' => $trip_id,
                'name' => 'قوارب',

            ],
            [
                'trip_id' => $trip_id,
                'name' => 'تنظيف مجاني',

            ],
            [
                'trip_id' => $trip_id,
                'name' => 'انترنت',

            ],
        ];
        DB::table('features')->insert($trip_facilities);




        //------------------------------------------------------------------------------------- 4

        $trip = [
               'price' => rand(1, 785),
           
            'name' => 'فندق الجبال',
            'image' => 'trip/5.png',
            'country' => 'رحله استكشاف',
            'review' => rand(0, 5),
            'status' => '1',
            'event_id' => 3,
            'user_id' => 1,
            'created_at' => now(),
            'updated_at' => now(),
        ];

        $trip_id = DB::table('trips')->insertGetId($trip);

        $trip_details = [
            
            
            'bank' => 'نقدي',      
            'description' => 'قد يظن البعض أن الفائدة من السفر والرحلات هو تغيير الجو وتحسين النفسية كما يقولون، ولا يعلم الكثيرين أن للسفر فوائد ومنافع أخرى تنعكس على شخصية الفرد وثقافته وتجعله يحب السفر والترحال كثيراً، وقد نقل التاريخ المعلومات عن الكثير من الشخصيات العظيمة التي اكتسبت مكانتها بسبب سفرها والفوائد التي جنتها من ذلك، وفيما يأتي نذكر فوائد السفر. فوائد السفر والرحلات زيادة الثقافة حيث إن الاهتمام بالجغرافيا وبعادات الشعوب وطريقة حياتهم يجعل الشخص ملمّاً بجغرافية البلاد بشكل كبير ولديه معلومات ثابتة وصحيحة في ذهنه عن تلك البلاد،',
            'working_days' => 'السبت,الاحد,الاثنين,الثلاثاء,الاربعاء,الخميس',
            'price_day' => rand(1, 300),
            'price_hour' => rand(1, 100),
            'start_time' => '2023/3/15',
            'end_time' => '2023/3/25',
            'addrees' => 'دبي مول وبجوار برج خليفة',      
            'season' => 'الشتاءالصيف',
            'city' => 'دبي',
            'longitude' => '55.296249',
            'latitude' => '25.276987',
            'trip_id' => $trip_id,
        ];

        DB::table('trip_detalis')->insert($trip_details);

        

        $trip_facilities = [
            [
                'trip_id' => $trip_id,
                'name' => 'قوارب',

            ],
            [
                'trip_id' => $trip_id,
                'name' => 'تنظيف مجاني',

            ],
            [
                'trip_id' => $trip_id,
                'name' => 'انترنت',

            ],
        ];
        DB::table('features')->insert($trip_facilities);




        //------------------------------------------------------------------------------------- 5

        $trip = [
               'price' => rand(1, 785),
           
            'name' => 'فله دورين.',
            'image' => 'trip/6.png',
            'country' => 'الامارات',
            'review' => rand(0, 5),
            'status' => '1',
            'event_id' => 3,
            'user_id' => 1,
            'created_at' => now(),
            'updated_at' => now(),
        ];

        $trip_id = DB::table('trips')->insertGetId($trip);

        $trip_details = [
            
            
            'bank' => 'نقدي',      
            'description' => 'قد يظن البعض أن الفائدة من السفر والرحلات هو تغيير الجو وتحسين النفسية كما يقولون، ولا يعلم الكثيرين أن للسفر فوائد ومنافع أخرى تنعكس على شخصية الفرد وثقافته وتجعله يحب السفر والترحال كثيراً، وقد نقل التاريخ المعلومات عن الكثير من الشخصيات العظيمة التي اكتسبت مكانتها بسبب سفرها والفوائد التي جنتها من ذلك، وفيما يأتي نذكر فوائد السفر. فوائد السفر والرحلات زيادة الثقافة حيث إن الاهتمام بالجغرافيا وبعادات الشعوب وطريقة حياتهم يجعل الشخص ملمّاً بجغرافية البلاد بشكل كبير ولديه معلومات ثابتة وصحيحة في ذهنه عن تلك البلاد،',
            'working_days' => 'السبت,الاحد,الاثنين,الثلاثاء,الاربعاء,الخميس',
            'price_day' => rand(1, 300),
            'price_hour' => rand(1, 100),
            'start_time' => '2023/3/15',
            'end_time' => '2023/3/25',
            'addrees' => 'دبي مول وبجوار برج خليفة',      
            'season' => 'الشتاء,الصيف',
            'city' => 'ابوظبي',
            'longitude' => '55.296249',
            'latitude' => '25.276987',
            'trip_id' => $trip_id,
        ];

        DB::table('trip_detalis')->insert($trip_details);

        

        $trip_facilities = [
            [
                'trip_id' => $trip_id,
                'name' => 'قوارب',

            ],
            [
                'trip_id' => $trip_id,
                'name' => 'تنظيف مجاني',

            ],
            [
                'trip_id' => $trip_id,
                'name' => 'انترنت',

            ],
        ];
        DB::table('features')->insert($trip_facilities);




        //------------------------------------------------------------------------------------- 6

        $trip = [
               'price' => rand(1, 785),
           
            'name' => 'شاليه مثالي.',
            'image' => 'trip/7.png',
            'country' => 'الامارات',
            'review' => rand(0, 5),
            'status' => '1',
            'event_id' => 3,
            'user_id' => 1,
            'created_at' => now(),
            'updated_at' => now(),
        ];

        $trip_id = DB::table('trips')->insertGetId($trip);

        $trip_details = [
            
            
            'bank' => 'رقمي',      
            'description' => 'قد يظن البعض أن الفائدة من السفر والرحلات هو تغيير الجو وتحسين النفسية كما يقولون، ولا يعلم الكثيرين أن للسفر فوائد ومنافع أخرى تنعكس على شخصية الفرد وثقافته وتجعله يحب السفر والترحال كثيراً، وقد نقل التاريخ المعلومات عن الكثير من الشخصيات العظيمة التي اكتسبت مكانتها بسبب سفرها والفوائد التي جنتها من ذلك، وفيما يأتي نذكر فوائد السفر. فوائد السفر والرحلات زيادة الثقافة حيث إن الاهتمام بالجغرافيا وبعادات الشعوب وطريقة حياتهم يجعل الشخص ملمّاً بجغرافية البلاد بشكل كبير ولديه معلومات ثابتة وصحيحة في ذهنه عن تلك البلاد،',
            'working_days' => 'السبت,الاحد,الاثنين,الثلاثاء,الاربعاء,الخميس',
            'price_day' => rand(1, 300),
            'price_hour' => rand(1, 100),
            'start_time' => '2023/3/15',
            'end_time' => '2023/3/25',
            'addrees' => 'دبي مول وبجوار برج خليفة',      
            'season' => 'الخريف,الربيع',
            'city' => 'الشارقه',
            'longitude' => '55.296249',
            'latitude' => '25.276987',
            'trip_id' => $trip_id,
        ];

        DB::table('trip_detalis')->insert($trip_details);

        

        $trip_facilities = [
            [
                'trip_id' => $trip_id,
                'name' => 'قوارب',

            ],
            [
                'trip_id' => $trip_id,
                'name' => 'تنظيف مجاني',

            ],
            [
                'trip_id' => $trip_id,
                'name' => 'انترنت',

            ],
        ];
        DB::table('features')->insert($trip_facilities);




        //------------------------------------------------------------------------------------- 7

        $trip = [
               'price' => rand(1, 785),
           
            'name' => 'فله الريف.',
            'image' => 'trip/8.png',
            'country' => 'الامارات',
            'review' => rand(0, 5),
            'status' => '1',
            'event_id' =>3,
            'user_id' => 1,
            'created_at' => now(),
            'updated_at' => now(),
        ];

        $trip_id = DB::table('trips')->insertGetId($trip);

        $trip_details = [
            
            
            'bank' => 'بنكي',      
            'description' => 'قد يظن البعض أن الفائدة من السفر والرحلات هو تغيير الجو وتحسين النفسية كما يقولون، ولا يعلم الكثيرين أن للسفر فوائد ومنافع أخرى تنعكس على شخصية الفرد وثقافته وتجعله يحب السفر والترحال كثيراً، وقد نقل التاريخ المعلومات عن الكثير من الشخصيات العظيمة التي اكتسبت مكانتها بسبب سفرها والفوائد التي جنتها من ذلك، وفيما يأتي نذكر فوائد السفر. فوائد السفر والرحلات زيادة الثقافة حيث إن الاهتمام بالجغرافيا وبعادات الشعوب وطريقة حياتهم يجعل الشخص ملمّاً بجغرافية البلاد بشكل كبير ولديه معلومات ثابتة وصحيحة في ذهنه عن تلك البلاد،',
            'working_days' => 'السبت,الاحد,الاثنين,الثلاثاء,الاربعاء,الخميس',
            'price_day' => rand(1, 300),
            'price_hour' => rand(1, 100),
            'start_time' => '2023/3/15',
            'end_time' => '2023/3/25',
            'addrees' => 'دبي مول وبجوار برج خليفة',      
            'season' => 'الربيع',
            'city' => 'عجمان',
            'longitude' => '55.296249',
            'latitude' => '25.276987',
            'trip_id' => $trip_id,
        ];

        DB::table('trip_detalis')->insert($trip_details);

        

        $trip_facilities = [
            [
                'trip_id' => $trip_id,
                'name' => 'قوارب',

            ],
            [
                'trip_id' => $trip_id,
                'name' => 'تنظيف مجاني',

            ],
            [
                'trip_id' => $trip_id,
                'name' => 'انترنت',

            ],
        ];
        DB::table('features')->insert($trip_facilities);




        //------------------------------------------------------------------------------------- 8


        $trip = [
               'price' => rand(1, 785),
           
            'name' => 'شاليه دهب',
            'image' => 'trip/9.png',
            'country' => 'الامارات',
            'review' => rand(0, 5),
            'status' => '1',
            'event_id' => 2,
            'user_id' => 1,
            'created_at' => now(),
            'updated_at' => now(),
        ];

        $trip_id = DB::table('trips')->insertGetId($trip);

        $trip_details = [
            
            
            'bank' => 'رقمي',      
            'description' => 'قد يظن البعض أن الفائدة من السفر والرحلات هو تغيير الجو وتحسين النفسية كما يقولون، ولا يعلم الكثيرين أن للسفر فوائد ومنافع أخرى تنعكس على شخصية الفرد وثقافته وتجعله يحب السفر والترحال كثيراً، وقد نقل التاريخ المعلومات عن الكثير من الشخصيات العظيمة التي اكتسبت مكانتها بسبب سفرها والفوائد التي جنتها من ذلك، وفيما يأتي نذكر فوائد السفر. فوائد السفر والرحلات زيادة الثقافة حيث إن الاهتمام بالجغرافيا وبعادات الشعوب وطريقة حياتهم يجعل الشخص ملمّاً بجغرافية البلاد بشكل كبير ولديه معلومات ثابتة وصحيحة في ذهنه عن تلك البلاد،',
            'working_days' => 'السبت,الاحد,الاثنين,الثلاثاء,الاربعاء,الخميس',
            'price_day' => rand(1, 300),
            'price_hour' => rand(1, 100),
            'start_time' => '2023/3/15',
            'end_time' => '2023/3/25',
            'addrees' => 'دبي مول وبجوار برج خليفة',      
            'season' => 'الشتاء,الخريف',
            'city' => 'عجمان',
            'longitude' => '55.296249',
            'latitude' => '25.276987',
            'trip_id' => $trip_id,
        ];

        DB::table('trip_detalis')->insert($trip_details);

        

        $trip_facilities = [
            [
                'trip_id' => $trip_id,
                'name' => 'قوارب',

            ],
            [
                'trip_id' => $trip_id,
                'name' => 'تنظيف مجاني',

            ],
            [
                'trip_id' => $trip_id,
                'name' => 'انترنت',

            ],
        ];
        DB::table('features')->insert($trip_facilities);




        //-------------------------------------------------------------------------------------9

        $trip = [
               'price' => rand(1, 785),
           
            'name' => 'رامادا تورز',
            'image' => 'trip/10.png',
            'country' => 'الامارات',
            'review' => rand(0, 5),
            'status' => '1',
            'event_id' => 2,
            'user_id' => 1,
            'created_at' => now(),
            'updated_at' => now(),
        ];

        $trip_id = DB::table('trips')->insertGetId($trip);

        $trip_details = [
            
            
            'bank' => 'حساب بنكي',      
            'description' => 'قد يظن البعض أن الفائدة من السفر والرحلات هو تغيير الجو وتحسين النفسية كما يقولون، ولا يعلم الكثيرين أن للسفر فوائد ومنافع أخرى تنعكس على شخصية الفرد وثقافته وتجعله يحب السفر والترحال كثيراً، وقد نقل التاريخ المعلومات عن الكثير من الشخصيات العظيمة التي اكتسبت مكانتها بسبب سفرها والفوائد التي جنتها من ذلك، وفيما يأتي نذكر فوائد السفر. فوائد السفر والرحلات زيادة الثقافة حيث إن الاهتمام بالجغرافيا وبعادات الشعوب وطريقة حياتهم يجعل الشخص ملمّاً بجغرافية البلاد بشكل كبير ولديه معلومات ثابتة وصحيحة في ذهنه عن تلك البلاد،',
            'working_days' => 'السبت,الاحد,الاثنين,الثلاثاء,الاربعاء,الخميس',
            'price_day' => rand(1, 300),
            'price_hour' => rand(1, 100),
            'start_time' => '2023/3/15',
            'end_time' => '2023/3/25',
            'addrees' => 'دبي مول وبجوار برج خليفة',      
            'season' => 'الصيف,الشتاء',
            'city' => 'الشارقه',
            'longitude' => '55.296249',
            'latitude' => '25.276987',
            'trip_id' => $trip_id,
        ];

        DB::table('trip_detalis')->insert($trip_details);

        

        $trip_facilities = [
            [
                'trip_id' => $trip_id,
                'name' => 'قوارب',

            ],
            [
                'trip_id' => $trip_id,
                'name' => 'تنظيف مجاني',

            ],
            [
                'trip_id' => $trip_id,
                'name' => 'انترنت',

            ],
        ];
        DB::table('features')->insert($trip_facilities);




        //------------------------------------------------------------------------------------- 10

        $trip = [
               'price' => rand(1, 785),
           
            'name' => 'فندق  ترافيل',
            'image' => 'trip/10.png',
            'country' => 'الامارات',
            'review' => rand(0, 5),
            'status' => '1',
            'event_id' => 2,
            'user_id' => 1,
            'created_at' => now(),
            'updated_at' => now(),
        ];

        $trip_id = DB::table('trips')->insertGetId($trip);

        $trip_details = [
            
            
            'bank' => 'نقدي',      
            'description' => 'قد يظن البعض أن الفائدة من السفر والرحلات هو تغيير الجو وتحسين النفسية كما يقولون، ولا يعلم الكثيرين أن للسفر فوائد ومنافع أخرى تنعكس على شخصية الفرد وثقافته وتجعله يحب السفر والترحال كثيراً، وقد نقل التاريخ المعلومات عن الكثير من الشخصيات العظيمة التي اكتسبت مكانتها بسبب سفرها والفوائد التي جنتها من ذلك، وفيما يأتي نذكر فوائد السفر. فوائد السفر والرحلات زيادة الثقافة حيث إن الاهتمام بالجغرافيا وبعادات الشعوب وطريقة حياتهم يجعل الشخص ملمّاً بجغرافية البلاد بشكل كبير ولديه معلومات ثابتة وصحيحة في ذهنه عن تلك البلاد،',
            'working_days' => 'السبت,الاحد,الاثنين,الثلاثاء,الاربعاء,الخميس',
            'price_day' => rand(1, 300),
            'price_hour' => rand(1, 100),
            'start_time' => '2023/3/15',
            'end_time' => '2023/3/25',
            'addrees' => 'دبي مول وبجوار برج خليفة',      
            'season' => 'الربيع',
            'city' => 'الشارقه',
            'longitude' => '55.296249',
            'latitude' => '25.276987',
            'trip_id' => $trip_id,
        ];

        DB::table('trip_detalis')->insert($trip_details);

        

        $trip_facilities = [
            [
                'trip_id' => $trip_id,
                'name' => 'قوارب',

            ],
            [
                'trip_id' => $trip_id,
                'name' => 'تنظيف مجاني',

            ],
            [
                'trip_id' => $trip_id,
                'name' => 'انترنت',

            ],
        ];
        DB::table('features')->insert($trip_facilities);




        //------------------------------------------------------------------------------------- 11
        $trip = [
            'price' => rand(1, 785),
        
         'name' => 'فله المهاجر',
         'image' => 'trip/5.png',
         'country' => 'الامارات', 
         
         'review' => rand(0, 5),
         'status' => '1',
         'event_id' => 2,
         'user_id' => 1,
         'created_at' => now(),
         'updated_at' => now(),
     ];

     $trip_id = DB::table('trips')->insertGetId($trip);

     $trip_details = [
         
       
         'bank' => 'نقدي',      
         'description' => 'قد يظن البعض أن الفائدة من السفر والرحلات هو تغيير الجو وتحسين النفسية كما يقولون، ولا يعلم الكثيرين أن للسفر فوائد ومنافع أخرى تنعكس على شخصية الفرد وثقافته وتجعله يحب السفر والترحال كثيراً، وقد نقل التاريخ المعلومات عن الكثير من الشخصيات العظيمة التي اكتسبت مكانتها بسبب سفرها والفوائد التي جنتها من ذلك، وفيما يأتي نذكر فوائد السفر. فوائد السفر والرحلات زيادة الثقافة حيث إن الاهتمام بالجغرافيا وبعادات الشعوب وطريقة حياتهم يجعل الشخص ملمّاً بجغرافية البلاد بشكل كبير ولديه معلومات ثابتة وصحيحة في ذهنه عن تلك البلاد،',
         'working_days' => 'السبت,الاحد,الاثنين,الثلاثاء,الاربعاء,الخميس',
         'price_day' => rand(1, 300),
         'price_hour' => rand(1, 100),
         'start_time' => '2023/3/15',
         'end_time' => '2023/3/25',
         'addrees' => 'دبي مول وبجوار برج خليفة',      
         'season' => 'الربيع',
         'city' => 'الشارقه',
         'longitude' => '55.296249',
         'latitude' => '25.276987',
         'trip_id' => $trip_id,
     ];

     DB::table('trip_detalis')->insert($trip_details);

     

     $trip_facilities = [
         [
             'trip_id' => $trip_id,
             'name' => 'قوارب',

         ],
         [
             'trip_id' => $trip_id,
             'name' => 'تنظيف مجاني',

         ],
         [
             'trip_id' => $trip_id,
             'name' => 'انترنت',

         ],
     ];
     DB::table('features')->insert($trip_facilities);$trip = [
        'price' => rand(1, 785),
    
     'name' => 'شاليه المهاجر',
     'image' => 'trip/1.png',
     'country' => 'الامارات', 
     
     'review' => rand(0, 5),
     'status' => '1',
     'event_id' => 2,
     'user_id' => 1,
     'created_at' => now(),
     'updated_at' => now(),
 ];

 $trip_id = DB::table('trips')->insertGetId($trip);

 $trip_details = [
     
   
     'bank' => 'نقدي',      
     'description' => 'قد يظن البعض أن الفائدة من السفر والرحلات هو تغيير الجو وتحسين النفسية كما يقولون، ولا يعلم الكثيرين أن للسفر فوائد ومنافع أخرى تنعكس على شخصية الفرد وثقافته وتجعله يحب السفر والترحال كثيراً، وقد نقل التاريخ المعلومات عن الكثير من الشخصيات العظيمة التي اكتسبت مكانتها بسبب سفرها والفوائد التي جنتها من ذلك، وفيما يأتي نذكر فوائد السفر. فوائد السفر والرحلات زيادة الثقافة حيث إن الاهتمام بالجغرافيا وبعادات الشعوب وطريقة حياتهم يجعل الشخص ملمّاً بجغرافية البلاد بشكل كبير ولديه معلومات ثابتة وصحيحة في ذهنه عن تلك البلاد،',
     'working_days' => 'السبت,الاحد,الاثنين,الثلاثاء,الاربعاء,الخميس',
     'price_day' => rand(1, 300),
     'price_hour' => rand(1, 100),
     'start_time' => '2023/3/15',
     'end_time' => '2023/3/25',
     'addrees' => 'دبي مول وبجوار برج خليفة',      
     'season' => 'الربيع',
     'city' => 'الشارقه',
     'longitude' => '55.296249',
     'latitude' => '25.276987',
     'trip_id' => $trip_id,
 ];

 DB::table('trip_detalis')->insert($trip_details);

 

 $trip_facilities = [
     [
         'trip_id' => $trip_id,
         'name' => 'قوارب',

     ],
     [
         'trip_id' => $trip_id,
         'name' => 'تنظيف مجاني',

     ],
     [
         'trip_id' => $trip_id,
         'name' => 'انترنت',

     ],
 ];
 DB::table('features')->insert($trip_facilities);

     
    }
}